config.org
#+title: rostre's emacs configuration
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el

My emacs configuration. A lot of this is heavily inspired/directly copied from [[https://github.com/daviwil/emacs-from-scratch][daviwil's emacs-from-scratch]] repository and [[https://www.youtube.com/playlist?list=PLEoMzSkcN8oPH1au7H6B7bBJ4ZO7BXjSZ][series of videos]] which I seriously recommend watching for beginners to Emacs.
 
* prerequisites

Various things need installing external to this configuration before it'll all work. It's recommended to install them before running this config.

- [[https://github.com/be5invis/Iosevka][Iosevka font files]], particularly the monospace font "Iosevka".
- For the copilot stuff to work, follow the instructions at [[https://github.com/copilot-emacs/copilot.el][the copilot-emacs repo]].
- To use the LSP functionality with =eglot=, the LSP servers must be installed. See "lsp servers" below.
- =vterm= won't work unless =libtool= and =cmake= are installed to the OS.
- On Mac, =coreutils= needs to be installed in the OS before =gls= can be used. =gls= is the GNU ls, which is just "ls" on gnu/linux systems.
- =curl= is a requirement for =ob-http= to work.
- =terminal-notifier= is a command line tool for creating mac banner notifications, and is required for notifications from emacs to work on mac.
- =gdb= is needed for c, c++, and rust debugging with =dape=.
- =ripgrep= is required for =consult-ripgrep=.
  
** lsp servers

The python LSP server is [[https://emacs-lsp.github.io/lsp-mode/page/lsp-pylsp/][pylsp]]. I use the =black= formatter to style the code.

#+begin_src shell

  pip install 'python-lsp-server[all]'
  pip install pylsp-black

#+end_src

Rust requires =rust-analyzer=. That can be downloaded and compiled from source like this:

#+begin_src shell

  $ git clone https://github.com/rust-analyzer/rust-analyzer.git -b release
  $ cd rust-analyzer
  $ cargo xtask install --server # will install rust-analyzer into $HOME/.cargo/bin

#+end_src

C and C++ code uses =clangd=.

* postrequisites

Here's some things that might need to be done after the config has finished loading.

- You might need to run =M-x all-the-icons-install-fonts=. This is supposedly to be dealt with by the elisp written alongside usage of the =all-the-icons= package but I'm not 100% sure it works.
- Run =(mapc #'treesit-install-language-grammar (mapcar #'car treesit-language-source-alist))= to install all of the tree-sitter grammars. This only needs to be done once.

* troubleshooting

Sometimes elpaca reports an error for some packages on first load: "Cannot determine url from recipe". The solution to this problem is just to delete the elpaca cache files in =~/emacs-config/elpaca/cache= and restart emacs.

* bootstraps

This represents the most basic stuff needed to get a simple functional Emacs instance online. I don't want everything from work at home and vice versa.

** lexical binding

Lexical binding (or static binding) allows for scoped variables, rather than all variables being global. This makes things like closures possible.

#+begin_src emacs-lisp
;; -*- lexical-binding: t; -*-
#+end_src

The =-*-= syntax makes the variable setting of =lexical-binding= into a [[https://www.emacswiki.org/emacs/FileLocalVariables][file-local variable]], which means that anything configured inside is only configured for that file. In this case it's a good way of turning on lexical binding for the entire init.el file.

** configuration flags/variables

A list of switches for turning things on and off.

** configuration tangling

"Tangling" takes all org-babel code sections out of an org-mode file, concatenates them together, and exports them to a separate file. In this case I use it to export all of the configuration from here into a plain elisp file so that Emacs can run it on startup.

The function below checks if the file visited is the literate config file (this one!) and then if it is, runs =org-babel-tangle= bypassing the confirmation message.

=org-babel-tangle= itself will actually use the file properties in order to determine how to tangle the various code blocks. It is specified as =#+PROPERTY: header-args:emacs-lisp :tangle ./basics.el=, which means "tangle all emacs-lisp code blocks together into the file basics.el". It is also possible to specify only specific code blocks to tangle, but this is more convenient.

#+begin_src emacs-lisp

  (setq this-config-org-file "~/emacs-config/config.org")

  (defun rostre/org-babel-tangle-config ()
    (when (string-equal (buffer-file-name)
                        (expand-file-name this-config-org-file))
      (let ((org-confirm-babel-evaluate nil))
        (org-babel-tangle))))

#+end_src

Now I add a hook to =org-mode= that will run this function every time an =org= file is saved. It'll only actually do anything if visiting this file though.

#+begin_src emacs-lisp

  (add-hook 'org-mode-hook
            (lambda ()
              (add-hook 'after-save-hook #'rostre/org-babel-tangle-config)))

#+end_src

** package management

I will use [[https://github.com/progfolio/elpaca][elpaca]] for package management instead of the default =package.el= as it offers some quality-of-life upgrades, and the ability to install packages directly from their source repositories asynchronously, i.e. without blocking the main emacs thread. It also supports MELPA out of the box.

Firstly, disable the built in package.el as we no longer need it. This has to be tangled into the =early-init.el= file, otherwise =package.el= is still loaded.

#+begin_src emacs-lisp :tangle ./early-init.el

  (setq package-enable-at-startup nil)

#+end_src

 The following code is all copy-pasted from the setup guide for elpaca.

#+begin_src emacs-lisp

  (defvar elpaca-installer-version 0.7)
  (defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))
  (defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
  (defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
  (defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
                                :ref nil :depth 1
                                :files (:defaults "elpaca-test.el" (:exclude "extensions"))
                                :build (:not elpaca--activate-package)))
  (let* ((repo  (expand-file-name "elpaca/" elpaca-repos-directory))
         (build (expand-file-name "elpaca/" elpaca-builds-directory))
         (order (cdr elpaca-order))
         (default-directory repo))
    (add-to-list 'load-path (if (file-exists-p build) build repo))
    (unless (file-exists-p repo)
      (make-directory repo t)
      (when (< emacs-major-version 28) (require 'subr-x))
      (condition-case-unless-debug err
          (if-let ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                   ((zerop (apply #'call-process `("git" nil ,buffer t "clone"
                                                   ,@(when-let ((depth (plist-get order :depth)))
                                                       (list (format "--depth=%d" depth) "--no-single-branch"))
                                                   ,(plist-get order :repo) ,repo))))
                   ((zerop (call-process "git" nil buffer t "checkout"
                                         (or (plist-get order :ref) "--"))))
                   (emacs (concat invocation-directory invocation-name))
                   ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
                                         "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                   ((require 'elpaca))
                   ((elpaca-generate-autoloads "elpaca" repo)))
              (progn (message "%s" (buffer-string)) (kill-buffer buffer))
            (error "%s" (with-current-buffer buffer (buffer-string))))
        ((error) (warn "%s" err) (delete-directory repo 'recursive))))
    (unless (require 'elpaca-autoloads nil t)
      (require 'elpaca)
      (elpaca-generate-autoloads "elpaca" repo)
      (load "./elpaca-autoloads")))
  (add-hook 'after-init-hook #'elpaca-process-queues)
  (elpaca `(,@elpaca-order))

#+end_src

I will also use the =use-package= tool to configure packages through the rest of this configuration. This just makes it much more convenient to configure packages with elisp.

#+begin_src emacs-lisp

  (elpaca elpaca-use-package
    (elpaca-use-package-mode))

#+end_src

One thing to configure on =use-package= is that we always want to download packages if they don't already exist on the system. That can be configured by always setting =ensure=.

#+begin_src emacs-lisp

  (setq use-package-always-ensure t)

#+end_src

This however does not keep packages up to date, so it's important to do that manually from time to time to fix the issues that arise as a result.

I could instead choose to install the packages manually and then commit my whole =.emacs.d= directory to source control as a way to keep it stable. This would lead to a large amount of code being lugged around between systems though. Ideally there would be a way to lock the versions in place until I decided to upgrade them deliberately, but elpaca does not support lockfiles at the moment.

** modifier keys for mac

If on mac, assign =s= (super) key to Option and assign =M= (meta) key to Cmd.

#+begin_src emacs-lisp

  (when (eq system-type 'darwin)
    (progn
      (setq mac-option-key-is-meta nil)
      (setq mac-option-modifier 'super)
      (setq mac-command-key-is-meta t)
      (setq mac-command-modifier 'meta)))

#+end_src

** key bindings

The =general= package makes it very easy to set up plenty of custom key bindings and override existing ones if necessary. I set it up here so that I can define key bindings as I go through this configuration.

I have one key binding to set up here - =M-o= for switching windows. I always forget to use it over =C-x o= though.

#+begin_src emacs-lisp

  (use-package general
    :ensure (:wait t) ;; wait as we use general.el throughout the rest of the config
    :config (general-define-key "M-o" 'other-window))

#+end_src

It's also useful to set up =repeat-mode= so that you can repeat common chords with single key presses. The default ones that are available are pretty useful in themselves.

#+begin_src emacs-lisp

  (repeat-mode)

#+end_src

Another nice to have when typing key chords is =which-key=, which provides a help popup when a partial chord is entered that gives you a list of options of what keys can follow.

#+begin_src emacs-lisp

  (use-package which-key
    :diminish which-key-mode
    :config
    (setq which-key-idle-delay 0.3)
    (which-key-mode))

#+end_src

* theming

This contains all the colour, font, and general settings for making Emacs look pretty.

