config.org
** fonts

Set up the default, fixed-pitch (monospace) and variable-pitch (non-monospace) fonts for emacs.

#+begin_src emacs-lisp

  (if (eq system-type 'darwin)
      (setq rostre/font-size 140)
    (setq rostre/font-size 120))

  (set-face-attribute 'default nil
                      :font "Iosevka"
                      :height rostre/font-size)

  (set-face-attribute 'fixed-pitch nil
                      :font "Iosevka"
                      :height rostre/font-size)

  (set-face-attribute 'variable-pitch nil
                      :font "Iosevka"
                      :height rostre/font-size)

#+end_src

We can customize specific font-faces for certain contexts as well. Mainly this is useful in org-mode for making the headings larger.

#+begin_src emacs-lisp

  (defun rostre/org-faces ()
	(set-face-attribute 'org-document-title nil :height 1.4)
	(set-face-attribute 'org-todo nil :height 1.0)
	(set-face-attribute 'org-level-1 nil :height 1.3)
	(set-face-attribute 'org-level-2 nil :height 1.2)
	(set-face-attribute 'org-level-3 nil :height 1.2)
	(set-face-attribute 'org-level-4 nil :height 1.2)
	(set-face-attribute 'org-level-5 nil :height 1.2)
	(set-face-attribute 'org-level-6 nil :height 1.2))

  (add-hook 'org-mode-hook 'rostre/org-faces)

#+end_src

*** custom faces
:PROPERTIES:
:CREATED:  [2024-10-04 14:58:57]
:END:

This section contains changes made through =M-x customize-face=, which is a convenient face to modify the face of some text at point. Only one of these sections should exist in the config.

#+begin_src emacs-lisp

  (custom-set-faces
  ;; custom-set-faces was added by Custom.
  ;; If you edit it by hand, you could mess it up, so be careful.
  ;; Your init file should contain only one such instance.
  ;; If there is more than one, they won't work right.
  '(bold ((t (:foreground "#6e94b9" :weight bold))))
  '(italic ((t (:foreground "#f7e3af" :slant italic)))))

#+end_src

** frame layout

Remove the title bar and scrollbars to maximise the amount of buffer space. I never use them and try to focus on keyboard use rather than mouse use.

#+begin_src emacs-lisp

  ;; Remove title bar on Mac
  (when (eq system-type 'darwin)
    (add-to-list 'default-frame-alist '(undecorated-round . t)))

  ;; Remove UI cruft
  (tool-bar-mode -1)
  (menu-bar-mode -1)
  (toggle-scroll-bar -1)

#+end_src

** buffer layout

Turn on line and column number rulers for prog-mode buffers.

#+begin_src emacs-lisp

  (add-hook 'prog-mode-hook 'display-line-numbers-mode)

#+end_src

I also use =breadcrumb= which adds a title bar that shows which sub-block we're inside in the current file.

#+begin_src emacs-lisp

  (use-package breadcrumb
    :config
    (breadcrumb-mode))

#+end_src

In org-mode buffers that use =org-indent-mode=, it's useful to have bars that indicate which block belongs to which. The =org-bars= package provides those, colour-coded to the headers.

The =:ensure= section allows the package to be directly installed from a github repository, as it's not available on one of the common package distributors like MELPA or ELPA.

#+begin_src emacs-lisp

  (use-package org-bars
    :if (eq system-type 'gnu/linux) ;; it's not rendering properly on mac
    :ensure (:host github :repo "https://github.com/tonyaldon/org-bars")
    :hook (org-mode . org-bars-mode))

#+end_src

** colours

Load a general colour theme. I've gone for "timu-rouge" from MELPA.

#+begin_src emacs-lisp

  (use-package timu-rouge-theme
    :config (load-theme 'timu-rouge t))

#+end_src

** transparency

Define a global minor mode that toggles background transparency for emacs, and bind it to =C-c x=.

#+begin_src emacs-lisp

  (define-minor-mode global-transparent-background-mode
    "Toggles background transparency for emacs frames"
    :init-value nil
    :global t
    (if global-transparent-background-mode
        (progn
          (set-frame-parameter (selected-frame) 'alpha '(95 . 95))
          (add-to-list 'default-frame-alist '(alpha . (95 95))))
      (progn
        (set-frame-parameter (selected-frame) 'alpha '(100 . 100))
        (assq-delete-all 'alpha default-frame-alist))))

  (general-define-key "C-c x" 'global-transparent-background-mode)

#+end_src

For linux, I want this on by default - window tiling is much better supported by the OS there, at least on Sonoma. It looks like Sequoia has better support, so we'll try that when I'm able to upgrade.

#+begin_src emacs-lisp

  (when (eq system-type 'gnu/linux)
    (global-transparent-background-mode))

#+end_src

** icons

The =all-the-icons= package includes a bunch of icons to be used with various other emacs packages, such as dired for icons that depict the type of file in the listing.

#+begin_src emacs-lisp

  (use-package all-the-icons
    :init
    (setq all-the-icons-was-installed (not (elpaca-installed-p 'all-the-icons)))
    :config
    (when all-the-icons-was-installed
      (all-the-icons-install-fonts)))

#+end_src

** modeline

The modeline is the bar along the bottom of an emacs buffer that gives various information about that buffer, including the current major mode and name of the buffer.

=keycast= shows the last keybinding that was used, along with the function that it called. It can be quite useful for figuring out what a particular key binding does so that you can represent it in elisp.

#+begin_src emacs-lisp

  (use-package keycast
    :config (keycast-mode-line-mode))

#+end_src

** formatting

The =helpful= package provides some formatting for the help files so that they are easier to read. We remap a bunch of the 'describe' functions to use =helpful= instead.

#+begin_src emacs-lisp

  (use-package helpful
    :bind
    ([remap describe-function] . describe-function)
    ([remap describe-command] . helpful-command)
    ([remap describe-variable] . describe-variable)
    ([remap describe-key] . helpful-key))

#+end_src

* editing

This section contains configuration for a bunch of tools that help primarily moving around and between emacs buffers quickly and efficiently.

** search and completions

A number of packages work together to provide auto-completion menus for many other utilities in emacs. These packages are =vertico=, =consult=, =orderless=, =marginalia=. I'll now install all of these and explain what they do.

=vertico= provides a UI for search results in an information-rich vertical list. This can kick in any situation that requires a menu particularly for completions of some partially typed text, such as =M-x= or =find-file=. =vertico-cycle= enables going off the bottom of the list and starting back at the top.

#+begin_src emacs-lisp

  (use-package vertico
    :config
    (setq vertico-cycle t)
    (vertico-mode))

#+end_src

=consult= provides some search and navigation commands and some better alternatives to in-built emacs tools. I set up bindings here specifically for a few of it's features:

- =consult-line= is useful for searching whole buffers and seeing all of the matches in a =vertico= list.
- =consult-buffer= is a better alternative to =switch-to-buffer= that groups buffers into sections and can open files that don't actually have open buffers yet.
- =consult-ripgrep= invokes the =ripgrep= tool that searches the content of entire directories for a search term in a flash.
- =consult-outline= provides a list of the headings or signatures in a file to navigate about quickly.

#+begin_src emacs-lisp

  (use-package consult
    :config
    (general-define-key "s-s" 'consult-line
                        "C-x b" 'consult-buffer
                        "C-c g" 'consult-ripgrep
                        "C-c o" 'consult-outline))

#+end_src

=orderless= provides enhanced search for =vertico=, allowing you to put in search terms separated by spaces that can be out of order from how they appear in the search results. It's particularly useful if I can't remember if it's =replace-string= or =string-replace=. There are a few additional configuration options suggested in the source repository to make sure that completions are available even if dynamic completion tables are required, and to allow more sophisticated completions like =/u/s/l= for =/usr/share/local=.

#+begin_src emacs-lisp

  (use-package orderless
    :config
    (setq completion-styles '(orderless basic))
    (setq completion-category-overrides '((file (styles basic partial-completion)))))

#+end_src

=marginalia= provides rich detail about the search results that are populated in =vertico=.

#+begin_src emacs-lisp
  
  (use-package marginalia
    :after vertico
    :config
    (setq marginalia-annotators '(marginalia-annotators-heavy marginalia-annotators-light nil))
    (marginalia-mode))

#+end_src

=corfu= and =cape= together provide the front and back-end respectively for in-buffer code completions. We allow cycling from end to start like with =vertico=, set it to automatically try to complete without any additional key presses, and allow previewing of the term at point.

If inside a buffer, we want to include a space in the search term for the completion, we can use =s-SPC= to add a space without breaking the current search term.

#+begin_src emacs-lisp

  (use-package corfu
    :bind
    ;; use super-Space to use orderless search in corfu completions
    (:map corfu-map ("s-SPC" . corfu-insert-separator))
    :config
    (setq corfu-cycle t) ;; cycle selection box
    (setq corfu-auto t) ;; automatically try to complete
    (setq corfu-preview-current t)
    (global-corfu-mode)
    (corfu-popupinfo-mode))

  (use-package cape)

#+end_src

