init.el
    (setq rostre/font-size 140)
  (setq rostre/font-size 120))

(set-face-attribute 'default nil
                    :font "Iosevka"
                    :height rostre/font-size)

(set-face-attribute 'fixed-pitch nil
                    :font "Iosevka"
                    :height rostre/font-size)

(set-face-attribute 'variable-pitch nil
                    :font "Iosevka"
                    :height rostre/font-size)

(defun rostre/org-faces ()
  (set-face-attribute 'org-document-title nil :height 1.4)
  (set-face-attribute 'org-todo nil :height 1.0)
  (set-face-attribute 'org-level-1 nil :height 1.3)
  (set-face-attribute 'org-level-2 nil :height 1.2)
  (set-face-attribute 'org-level-3 nil :height 1.2)
  (set-face-attribute 'org-level-4 nil :height 1.2)
  (set-face-attribute 'org-level-5 nil :height 1.2)
  (set-face-attribute 'org-level-6 nil :height 1.2))

(add-hook 'org-mode-hook 'rostre/org-faces)

;; Remove title bar on Mac
(when (eq system-type 'darwin)
  (add-to-list 'default-frame-alist '(undecorated-round . t)))

;; Remove UI cruft
(tool-bar-mode -1)
(menu-bar-mode -1)
(toggle-scroll-bar -1)

(add-hook 'prog-mode-hook 'display-line-numbers-mode)

(use-package breadcrumb
  :config
  (breadcrumb-mode))

(use-package org-bars
  :if (eq system-type 'gnu/linux) ;; it's not rendering properly on mac
  :ensure (:host github :repo "https://github.com/tonyaldon/org-bars")
  :hook (org-mode . org-bars-mode))

(use-package timu-rouge-theme
  :config (load-theme 'timu-rouge t))

(define-minor-mode global-transparent-background-mode
  "Toggles background transparency for emacs frames"
  :init-value nil
  :global t
  (if global-transparent-background-mode
      (progn
        (set-frame-parameter (selected-frame) 'alpha '(95 . 95))
        (add-to-list 'default-frame-alist '(alpha . (95 95))))
    (progn
      (set-frame-parameter (selected-frame) 'alpha '(100 . 100))
      (assq-delete-all 'alpha default-frame-alist))))

(general-define-key "C-c x" 'global-transparent-background-mode)

(when (eq system-type 'gnu/linux)
  (global-transparent-background-mode))

(use-package all-the-icons
  :init
  (setq all-the-icons-was-installed (not (elpaca-installed-p 'all-the-icons)))
  :config
  (when all-the-icons-was-installed
    (all-the-icons-install-fonts)))

(use-package keycast
  :config (keycast-mode-line-mode))

(use-package helpful
  :bind
  ([remap describe-function] . describe-function)
  ([remap describe-command] . helpful-command)
  ([remap describe-variable] . describe-variable)
  ([remap describe-key] . helpful-key))

(use-package vertico
  :config
  (setq vertico-cycle t)
  (vertico-mode))

(use-package consult
  :config
  (general-define-key "s-s" 'consult-line
                      "C-x b" 'consult-buffer
                      "C-c g" 'consult-ripgrep
                      "C-c o" 'consult-outline))

(use-package orderless
  :config
  (setq completion-styles '(orderless basic))
  (setq completion-category-overrides '((file (styles basic partial-completion)))))

(use-package marginalia
  :after vertico
  :config
  (setq marginalia-annotators '(marginalia-annotators-heavy marginalia-annotators-light nil))
  (marginalia-mode))

(use-package corfu
  :bind
  ;; use super-Space to use orderless search in corfu completions
  (:map corfu-map ("s-SPC" . corfu-insert-separator))
  :config
  (corfu-cycle t) ;; cycle selection box
  (corfu-auto t) ;; automatically try to complete
  (corfu-preview-current t)
  (global-corfu-mode)
  (corfu-popupinfo-mode))

(use-package cape)
