config.org
** frame navigation

=avy= provides some useful functions for hopping around the whole emacs frame based on a search string. This usage is heavily inspired by [[https://karthinks.com/software/avy-can-do-anything/#avy-plus-embark-any-action-anywhere][this fantastic Karthinks article on avy]] which suggests using =avy-goto-char-timer= to move around emacs, in combination with =embark-act= to then do things at that point in the window without even moving the cursor.

=embark= allows some standard actions to be performed directly in certain contexts, such as in a =vertico= menu or at an =avy= target. This means that things can be accomplished with a selection without even visiting the target. =embark-consult= provides some integration with the =consult= package.

I've written a custom action that operates on the =org-agenda= and allows clocking in or changing the status of an org TODO item in the agenda without actually moving the cursor to it.

#+begin_src emacs-lisp

  (use-package embark
    :config
    (general-define-key "C-." 'embark-act)
    
    (defvar-keymap embark-org-agenda-heading-map
      :doc "Keymap for org-agenda view actions"
      :parent embark-general-map
      "t" #'org-agenda-todo
      "i" #'org-agenda-clock-in))

  (use-package embark-consult)

#+end_src

We need to explicitly link up =avy= with =embark=, first by specifying an =avy= action.

#+begin_src emacs-lisp

  (defun avy-action-embark (pt)
    (unwind-protect
        (save-excursion
          (goto-char pt)
          (embark-act))
      (select-window
       (cdr (ring-ref avy-ring 0))))
    t)

#+end_src

There are a couple of other useful =avy= actions we can set up which mark a region from point to the target or show help at the target.

#+begin_src emacs-lisp

  (defun avy-action-mark-to-char (pt)
    (activate-mark)
    (goto-char pt))

  (defun avy-action-helpful (pt)
    (save-excursion
      (goto-char pt)
      (helpful-at-point))
    (select-window
     (cdr (ring-ref avy-ring 0)))
    t)

#+end_src

We can now install =avy= and register all the above actions we've defined with it.

#+begin_src emacs-lisp

  (use-package avy
    :config
    (general-define-key "C-;" 'avy-goto-char-timer)
    (setf (alist-get ?. avy-dispatch-alist) 'avy-action-embark
	  (alist-get ?k avy-dispatch-alist) 'avy-action-kill-stay
	  (alist-get ?w avy-dispatch-alist) 'avy-action-copy
	  (alist-get ?y avy-dispatch-alist) 'avy-action-yank
	  (alist-get ?M avy-dispatch-alist) 'avy-action-mark-to-char
	  (alist-get ?H avy-dispatch-alist) 'avy-action-helpful))

#+end_src

*** custom frame navigation

These are some frame navigation functions I cooked up myself.

I override the default split-window functions with my own versions that also change focus to the new window.

#+begin_src emacs-lisp

  (defun rostre/split-window-right ()
    (interactive)
    (select-window (split-window-right)))

  (general-define-key "C-x 3" 'rostre/split-window-right)

  (defun rostre/split-window-below ()
    (interactive)
    (select-window (split-window-below)))

  (general-define-key "C-x 2" 'rostre/split-window-below)

#+end_src

** custom editing

This is a collection of functions that I've created to make my own editing easier.

These two functions delete whitespace from point to the next non-whitespace character, either backwards or forwards. This is something I commonly find myself doing manually when coding particularly, as =M-d= or =M-<backspace>= end up deleting some text along with the whitespace I wanted to clear.

#+begin_src emacs-lisp

  (defun rostre/delete-whitespace-backwards ()
    "Delete all of the whitespace before point"
    (interactive)
    (save-excursion
      (setq-local end-loc (point))
      (re-search-backward "[^\s\n\t]")
      (forward-char)
      (delete-region (point) end-loc)))

  (general-define-key "s-<backspace>" 'rostre/delete-whitespace-backwards)

  (defun rostre/delete-whitespace-forwards ()
    "Delete all of the whitespace before point"
    (interactive)
    (save-excursion
      (setq-local start-loc (point))
      (re-search-forward "[^\s\n\t]")
      (forward-char)
      (delete-region start-loc (point))))

  (general-define-key "s-d" 'rostre/delete-whitespace-forwards)

#+end_src

** quality of life

A few settings that make for smoother use of emacs.

First change the yes/no prompt to a y/n prompt, as it's faster to type.

#+begin_src emacs-lisp

  (defalias 'yes-or-no-p 'y-or-n-p)

#+end_src

Automatically "revert" (reload) buffers from file when they change.

#+begin_src emacs-lisp

  (global-auto-revert-mode 1)
  (setq global-auto-revert-non-file-buffers t)

#+end_src

Save the minibuffer history so that we can rerun =M-x= commands particularly from the recent history.

#+begin_src emacs-lisp

  (setq history-length 25)
  (savehist-mode 1)

#+end_src

By default, emacs leaves a ton of temporary files all over the place, which can be a bit of a pain. We can redirect all of those files to a single directory so that they stay out of the way.

#+begin_src emacs-lisp

  ;; create the directory if it doesn't exist
  (when (not (file-directory-p "~/.emacs-temp-files"))
    (make-directory "~/.emacs-temp-files/"))
  (setq temporary-file-directory "~/.emacs-temp-files/")

  ;; redirect backup files
  (setq backup-directory-alist
        `((".*" . ,temporary-file-directory)))

  ;; redirect autosave files
  (setq auto-save-file-name-transforms
        `((".*" ,temporary-file-directory t)))

  ;; redirect lock files
  (setq lock-file-name-transforms
        `((".*" ,temporary-file-directory t)))

#+end_src

** key bindings

There's a few navigation/editing functions I have bound in the =C-c= space for easy access.
- =C-c c= jumps directly to my emacs config file.
- =C-c r= re-evaluates my whole config file.
- =C-c w= cycles the windows around in the frame.

#+begin_src emacs-lisp

  (general-define-key :prefix "C-c"
                      "c" (lambda () (interactive) (find-file "~/emacs-config/config.org"))
                      "r" (lambda () (interactive) (load-file "~/emacs-config/init.el"))
                      "w" 'window-swap-states)

#+end_src

* source control

I use =magit= for all my git needs these days. It is a key-driven interface to git that uses the =transient= module to show all the possible commands and the key bindings for them.

First install the =transient= and =seq= packages as magit depends on those.

#+begin_src emacs-lisp

  (use-package seq)
  (use-package transient
    :after 'seq)
  
#+end_src

Now install magit, with an extra configuration line to display the magit status buffer in the same window as the cursor.

#+begin_src emacs-lisp

  (use-package magit
    :after transient seq
    :custom
    (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

#+end_src

* note taking

** org-mode

There's some basic set-up to do with org-mode before we starting augmenting it with packages such as Denote. First set a couple of variables to indicate where my notes are.

#+begin_src emacs-lisp

  (setq work-notes-directory "~/work_notes/")
  (setq personal-notes-directory "~/synced_notes/")
  
#+end_src

I want org mode to use variable-pitch (i.e. non-monospace) fonts and =visual-line-mode=, which wraps the text onto a new line rather than making it extend out of the visible window. I also enable =org-indent-mode= that indents the blocks of text based on their parent header nesting level. To do all this, I specify a function that will be called as a hook when org-mode is invoked. This means that these commands will only be invoked when opening org-mode files.

#+begin_src emacs-lisp

  (defun rostre/org-buffer-setup ()
    (variable-pitch-mode 1)
    (visual-line-mode 1)
    (org-indent-mode))

#+end_src

We can set up the hook using =add-hook=. Now all of the above commands will run when a buffer is opened with org-mode.

#+begin_src emacs-lisp
  
  (add-hook 'org-mode-hook 'rostre/org-buffer-setup)

#+end_src

Now we can get into the nitty-gritty of configuration. There's a few aesthetic things to sort out - making the ellipses look nicer, make sure empty lines are shown when headers are collapsed, and make sure images are scaled to the window. I also hide /emphasis/ *markers* to make the text nicer to read.

#+begin_src emacs-lisp

  (setq org-ellipsis " ⮠")
  (setq org-cycle-separator-lines -1)
  (setq org-image-actual-width nil)
  (setq org-hide-emphasis-markers t)
  
#+end_src

There are also a few things to set up with how TODO items are handled.

We want the timestamp saved when a TODO is marked done:

#+begin_src emacs-lisp

  (setq org-log-done 'time)  

#+end_src

We want the logbook with the timestamps saved in the drawer section under the heading:

#+begin_src emacs-lisp

  (setq org-log-into-drawer t)  

#+end_src

We want to customise the TODO states:

#+begin_src emacs-lisp

  (setq org-todo-keywords
        '((sequence "TODO(t)" "RVEW(n!)" "WAIT(w@/!)" "|" "DONE(d!)" "CANC(c@)")))  

#+end_src

We want to allow for 5 levels of priority:

#+begin_src emacs-lisp
 
  (setq org-priority-highest ?A)
  (setq org-priority-lowest ?E)

#+end_src

We can also customise the tags that can be added to tasks here.

#+begin_src emacs-lisp

  (setq org-tag-alist '())

#+end_src

=org-download= allows images to be pasted in org-mode buffers.

#+begin_src emacs-lisp

  (use-package org-download
    :config
    (general-define-key "C-c y" 'org-download-clipboard))

#+end_src

=org-store-link= is a very useful function that generates a link to the current heading in an org-mode buffer, or even a location in any other buffer, and stores that to a register that can later be recalled with =org-insert-link=, which is bound to =C-c C-l=.

#+begin_src emacs-lisp

  (general-define-key "C-c q" 'org-store-link)

#+end_src

** journalling 

My journalling setup uses a single org file for all notes, which have tags and properties such that they can be searched and filtered with =org-match-sparse-tree= and =org-agenda=.

The following code adds the =CREATED= property to every new heading automatically, so that notes can be filtered by when they were created.

#+begin_src emacs-lisp

  (defun rostre/set-creation-date-property-on-new-heading ()
    (save-excursion
      (org-back-to-heading)
      (org-set-property "CREATED" (format-time-string "[%Y-%m-%d %T]"))))

  (add-hook 'org-insert-heading-hook #'rostre/set-creation-date-property-on-new-heading)

#+end_src

