init.el

(use-package embark
  :config
  (general-define-key "C-." 'embark-act)

  (defvar-keymap embark-org-agenda-heading-map
    :doc "Keymap for org-agenda view actions"
    :parent embark-general-map
    "t" #'org-agenda-todo
    "i" #'org-agenda-clock-in))

(use-package embark-consult)

(defun avy-action-embark (pt)
  (unwind-protect
      (save-excursion
        (goto-char pt)
        (embark-act))
    (select-window
     (cdr (ring-ref avy-ring 0))))
  t)

(defun avy-action-mark-to-char (pt)
  (activate-mark)
  (goto-char pt))

(defun avy-action-helpful (pt)
  (save-excursion
    (goto-char pt)
    (helpful-at-point))
  (select-window
   (cdr (ring-ref avy-ring 0)))
  t)

(use-package avy
  :config
  (general-define-key "C-;" 'avy-goto-char-timer)
  (setf (alist-get ?. avy-dispatch-alist) 'avy-action-embark
	(alist-get ?k avy-dispatch-alist) 'avy-action-kill-stay
	(alist-get ?w avy-dispatch-alist) 'avy-action-copy
	(alist-get ?y avy-dispatch-alist) 'avy-action-yank
	(alist-get ?M avy-dispatch-alist) 'avy-action-mark-to-char
	(alist-get ?H avy-dispatch-alist) 'avy-action-helpful))

(defun rostre/split-window-right ()
  (interactive)
  (select-window (split-window-right)))

(general-define-key "C-x 3" 'rostre/split-window-right)

(defun rostre/split-window-below ()
  (interactive)
  (select-window (split-window-below)))

(general-define-key "C-x 2" 'rostre/split-window-below)

(defun rostre/delete-whitespace-backwards ()
  "Delete all of the whitespace before point"
  (interactive)
  (save-excursion
    (setq-local end-loc (point))
    (re-search-backward "[^\s\n\t]")
    (forward-char)
    (delete-region (point) end-loc)))

(general-define-key "s-<backspace>" 'rostre/delete-whitespace-backwards)

(defun rostre/delete-whitespace-forwards ()
  "Delete all of the whitespace before point"
  (interactive)
  (save-excursion
    (setq-local start-loc (point))
    (re-search-forward "[^\s\n\t]")
    (forward-char)
    (delete-region start-loc (point))))

(general-define-key "s-d" 'rostre/delete-whitespace-forwards)

(defalias 'yes-or-no-p 'y-or-n-p)

(global-auto-revert-mode 1)
(setq global-auto-revert-non-file-buffers t)

(setq history-length 25)
(savehist-mode 1)

;; create the directory if it doesn't exist
(when (not (file-directory-p "~/.emacs-temp-files"))
  (make-directory "~/.emacs-temp-files/"))
(setq temporary-file-directory "~/.emacs-temp-files/")

;; redirect backup files
(setq backup-directory-alist
      `((".*" . ,temporary-file-directory)))

;; redirect autosave files
(setq auto-save-file-name-transforms
      `((".*" ,temporary-file-directory t)))

;; redirect lock files
(setq lock-file-name-transforms
      `((".*" ,temporary-file-directory t)))

(general-define-key :prefix "C-c"
                    "c" (lambda () (interactive) (find-file "~/emacs-config/config.org"))
                    "r" (lambda () (interactive) (load-file "~/emacs-config/init.el"))
                    "w" 'window-swap-states)

(use-package seq)
(use-package transient
  :after 'seq)

(use-package magit
  :after transient seq
  :custom
  (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

(setq work-notes-directory "~/work_notes/")
(setq personal-notes-directory "~/synced_notes/")

(defun rostre/org-buffer-setup ()
  (variable-pitch-mode 1)
  (visual-line-mode 1)
  (org-indent-mode))

(add-hook 'org-mode-hook 'rostre/org-buffer-setup)

(setq org-ellipsis " ⮠")
(setq org-cycle-separator-lines -1)
(setq org-image-actual-width nil)
(setq org-hide-emphasis-markers t)

(setq org-log-done 'time)

(setq org-log-into-drawer t)

(setq org-todo-keywords
      '((sequence "TODO(t)" "RVEW(n!)" "WAIT(w@/!)" "|" "DONE(d!)" "CANC(c@)")))

(setq org-priority-highest ?A)
(setq org-priority-lowest ?E)

(setq org-tag-alist '())

(use-package org-download
  :config
  (general-define-key "C-c y" 'org-download-clipboard))

(general-define-key "C-c q" 'org-store-link)

(defun rostre/set-creation-date-property-on-new-heading ()
  (save-excursion
    (org-back-to-heading)
    (org-set-property "CREATED" (format-time-string "[%Y-%m-%d %T]"))))

(add-hook 'org-insert-heading-hook #'rostre/set-creation-date-property-on-new-heading)
