config.org
*** capture templates

Capture templates allow quickly adding segments to org files from anywhere. We can use this to quickly add notes or tasks without breaking flow.

#+begin_src emacs-lisp

  (setq org-capture-templates
    '(("t" "Work Task" entry (file+headline "~/work_notes/work_journal.org" "work journal")
       "\n* TODO [#%^{Priority: |A|B|C|D|E}] %?\n:PROPERTIES:\n:CREATED: %U\n:END:\n\n" :empty-lines-before 1)
      ("n" "Work Note" entry (file+headline "~/work_notes/work_journal.org" "work journal")
       "\n* %?\n:PROPERTIES:\n:CREATED: %U\n:END:\n\n" :empty-lines-before 1 :clock-in t)
      ("d" "Work Diary" entry (file+headline "~/work_notes/work_diary.org" "work diary")
       "\n* %?\n%^T" :empty-lines-before 1)
      ("T" "Personal Task" entry (file+headline "~/synced_notes/journal.org" "personal journal")
       "\n* TODO [#%^{Priority: |A|B|C|D|E}] %?\n:PROPERTIES:\n:CREATED: %U\n:END:\n\n" :empty-lines-before 1)
      ("N" "Personal Note" entry (file+headline "~/synced_notes/journal.org" "personal journal")
       "\n* %?\n:PROPERTIES:\n:CREATED: %U\n:END:\n\n" :empty-lines-before 1)
      ("C" "Chore" entry (file+headline "~/synced_notes/chores.org" "chores")
       "\n* TODO [#%^{Priority: |A|B|C|D|E}] %?\n:PROPERTIES:\n:CREATED: %U\n:END:\n\n")))

  (general-define-key "C-c f c" 'org-capture)

#+end_src

** denote

=denote= is a package that allows the quick creation of new note files that are stored with predictable filenames and metadata such that they can be easily searched. This is good for storing a knowledge base.

All of my =denote= bindings are prefixed with =C-c d=.

#+begin_src emacs-lisp

  (use-package denote
    :ensure (:wait t) ;; wait so that denote functions can be referenced later
    :config
    ;; Key bindings
    (general-define-key :prefix "C-c d"
                        "n" 'denote
                        "c" 'rostre/capture-to-denote
                        "l" 'denote-link
                        "o" 'denote-link-after-creating
                        "f" 'consult-notes))

#+end_src

The following are a list of templates with which to initialise the body of a new denote note with. Mostly I use the "project" and "journal" ones here, although the "normal" one is useful for initialising adhoc notes with no headings.

#+begin_src emacs-lisp

  (setq denote-templates
    `(
      (normal . "")
      ;; A metanote is a collection of links to other notes
      (metanote . ,(concat "* links"
               "\n\n"))
      ;; A project is a collection of TODO tasks.
      (project . ,(concat "* tasks\n\n"
                          "* diary\n\n"
                          "* notes\n\n"
                          "* reminders\n\n"))))

#+end_src

The denote prompts are what denote asks for when creating a new note. I use the title, keywords, and template prompts.

#+begin_src emacs-lisp

  (setq denote-prompts
        '(title keywords template))

#+end_src

=denote-org-store-link-to-heading= is a useful setting that indicates that when =org-store-link= is called, that the link saved should be the one to the encompassing heading rather than the specific point in the file.

#+begin_src emacs-lisp

  (setq denote-org-store-link-to-heading t)

#+end_src

Denote's front matter by default doesn't contain "category", which is useful for adding to the agenda view as an indication of which file a particular TODO is found in. It also helps group the time logged on tasks in the clocktable by the file, which is useful if each project is represented by a file.

#+begin_src emacs-lisp

  (setq denote-org-front-matter
    "#+title:      %1$s
#+category:   %1$s
#+date:       %2$s
#+filetags:   %3$s
#+identifier: %4$s
\n")

#+end_src

=denote-menu=, along with =consult-notes=, provides a nicer interface to filtering and searching through notes.

#+begin_src emacs-lisp

  (use-package denote-menu
    :custom
    (denote-menu-title-column-width 50)
    (denote-menu-show-file-type nil)
    :bind (:map denote-menu-mode-map
        ("/ r" . denote-menu-filter)
        ("/ k" . denote-menu-filter-by-keyword)
        ("/ o" . denote-menu-filter-out-keyword)
        ("d" . denote-menu-export-to-dired)
        ("c" . denote-menu-clear-filters)
        ("g" . denote-menu-list-notes)))

  (use-package consult-notes
    :config
    (consult-notes-denote-mode))

#+end_src

** org-agenda

*** basic settings

For the agenda view, firstly we want to configure some basic settings. The first thing to set up is the key binding to open an agenda.

#+begin_src emacs-lisp

  (general-define-key "C-c a" 'org-agenda)

#+end_src

The file regexp decides what files to include from =org-agenda-files=.

#+begin_src emacs-lisp

  (setq org-agenda-file-regexp "\\`[^.].*\\.org\\'")

#+end_src

We want the agenda to open in the window that the cursor was in before the command was called:

#+begin_src emacs-lisp

  (setq org-agenda-window-setup 'current-window)

#+end_src

We want to avoid showing scheduled or deadline tasks in the agenda if they were marked as done:

#+begin_src emacs-lisp

  (setq org-agenda-skip-scheduled-if-done t)
  (setq org-agenda-skip-deadline-if-done t)  

#+end_src

Diary entries should be included:

#+begin_src emacs-lisp

  (setq org-agenda-include-diary t)

#+end_src

Clicking in the agenda does not follow the link elsewhere:

#+begin_src emacs-lisp

  (setq org-agenda-mouse-1-follows-link nil)  

#+end_src

The clocktable is a useful resource for summarising all the time logged on tasks during a particular day. It can be accessed by hitting =R= while the point is in the agenda. We configure that:

#+begin_src emacs-lisp
  
  (setq org-agenda-clockreport-parameter-plist '(:link t :maxlevel 2 :fileskip0 t :filetitle t)) 

#+end_src

*** org-agenda-files

The =org-agenda-files= variable contains all the files that the agenda should consider when building it's views. Now I have all my todos in a small number of org files, so I just hard code those:

#+begin_src emacs-lisp

  (defun rostre/org-notes-files (dir)
    (if (file-directory-p dir)
        (directory-files dir t "\.org$")
      '()))

  (setq org-agenda-files (append
                          (rostre/org-notes-files work-notes-directory)
                          (rostre/org-notes-files personal-notes-directory)))

#+end_src

