init.el

(setq org-capture-templates
  '(("t" "Work Task" entry (file+headline "~/work_notes/work_journal.org" "work journal")
     "\n* TODO [#%^{Priority: |A|B|C|D|E}] %?\n:PROPERTIES:\n:CREATED: %U\n:END:\n\n" :empty-lines-before 1)
    ("n" "Work Note" entry (file+headline "~/work_notes/work_journal.org" "work journal")
     "\n* %?\n:PROPERTIES:\n:CREATED: %U\n:END:\n\n" :empty-lines-before 1 :clock-in t)
    ("d" "Work Diary" entry (file+headline "~/work_notes/work_diary.org" "work diary")
     "\n* %?\n%^T" :empty-lines-before 1)
    ("T" "Personal Task" entry (file+headline "~/synced_notes/journal.org" "personal journal")
     "\n* TODO [#%^{Priority: |A|B|C|D|E}] %?\n:PROPERTIES:\n:CREATED: %U\n:END:\n\n" :empty-lines-before 1)
    ("N" "Personal Note" entry (file+headline "~/synced_notes/journal.org" "personal journal")
     "\n* %?\n:PROPERTIES:\n:CREATED: %U\n:END:\n\n" :empty-lines-before 1)))

(general-define-key "C-c f c" 'org-capture)

(use-package denote
  :ensure (:wait t) ;; wait so that denote functions can be referenced later
  :config
  ;; Key bindings
  (general-define-key :prefix "C-c d"
                      "n" 'denote
                      "c" 'rostre/capture-to-denote
                      "l" 'denote-link
                      "o" 'denote-link-after-creating
                      "f" 'consult-notes))

(setq denote-templates
  `(
    (normal . "")
    ;; A metanote is a collection of links to other notes
    (metanote . ,(concat "* links"
             "\n\n"))
    ;; A project is a collection of TODO tasks.
    (project . ,(concat "* tasks\n\n"
                        "* diary\n\n"
                        "* notes\n\n"
                        "* reminders\n\n"))))

(setq denote-prompts
      '(title keywords template))

(setq denote-org-store-link-to-heading t)

(setq denote-org-front-matter
    "#+title:      %1$s
#+category:   %1$s
#+date:       %2$s
#+filetags:   %3$s
#+identifier: %4$s
\n")

(use-package denote-menu
  :custom
  (denote-menu-title-column-width 50)
  (denote-menu-show-file-type nil)
  :bind (:map denote-menu-mode-map
      ("/ r" . denote-menu-filter)
      ("/ k" . denote-menu-filter-by-keyword)
      ("/ o" . denote-menu-filter-out-keyword)
      ("d" . denote-menu-export-to-dired)
      ("c" . denote-menu-clear-filters)
      ("g" . denote-menu-list-notes)))

(use-package consult-notes
  :config
  (consult-notes-denote-mode))

(general-define-key "C-c a" 'org-agenda)

(setq org-agenda-file-regexp "\\`[^.].*\\.org\\'")

(setq org-agenda-window-setup 'current-window)

(setq org-agenda-skip-scheduled-if-done t)
(setq org-agenda-skip-deadline-if-done t)

(setq org-agenda-include-diary t)

(setq org-agenda-mouse-1-follows-link nil)

(setq org-agenda-clockreport-parameter-plist '(:link t :maxlevel 2 :fileskip0 t :filetitle t))

(defun rostre/org-notes-files (dir)
  (if (file-directory-p dir)
      (directory-files dir t "\.org$")
    '()))

(setq org-agenda-files (append
                        (rostre/org-notes-files work-notes-directory)
                        (rostre/org-notes-files personal-notes-directory)))
