config.org
*** custom agenda views

I have one main custom agenda view, labelled "Dashboard", and a couple of additional utility ones for special circumstances.

The Dashboard view shows a typical agenda with the usual entries, and additional sections below that are organised by priority. Using those I can focus on the things that I need to do that day, whilst not losing track of lower priority items.

The Reminders view shows a list of TODOs that are tagged as "Reminder". This is usually a list of things I don't want to forget to talk about in the next meeting on a particular topic.

The Deadlines view shows all TODO items that have a deadline in the next month, which don't all show up if I just use the Dashboard view which only shows the deadlines up to 14 days away.

The Fun view shows all of my personal lists of books/tv shows/games I want to look at, plus mini-projects and things to pursue in spare time.

#+begin_src emacs-lisp

  (setq org-agenda-custom-commands 
        '(("j" "Dashboard"
           ((agenda "" (
                        (org-deadline-warning-days 14)
                        (org-agenda-span 'day)
                        (org-agenda-start-with-log-mode '(state clock))
                        (org-agenda-prefix-format "%-30b %-10t %-12s %-6e")
                        (org-agenda-files org-agenda-files)))
            (tags-todo "goal"
                       ((org-agenda-overriding-header "Goals")
                        (org-agenda-files
                         (rostre/org-notes-files work-notes-directory))))
            (tags-todo "-create_jira_card&+PRIORITY=\"A\"&-SCHEDULED>\"<2000-01-01 Sat>\""
                       ((org-agenda-overriding-header "Do Now")
                        (org-agenda-sorting-strategy '(effort-up))
                        (org-agenda-prefix-format "%-6e %-30c")
                        (org-agenda-files
                         (rostre/org-notes-files work-notes-directory))))
            (tags-todo "-create_jira_card&+PRIORITY=\"B\"&-SCHEDULED>\"<2000-01-01 Sat>\""
                       ((org-agenda-overriding-header "Do Later")
                        (org-agenda-sorting-strategy '(effort-up))
                        (org-agenda-prefix-format "%-6e %-30c")
                        (org-agenda-files
                         (rostre/org-notes-files work-notes-directory))))
            (tags-todo "create_jira_card&-SCHEDULED>\"<2000-01-01 Sat>\""
                       ((org-agenda-overriding-header "Create Jira Cards")
                        (org-agenda-prefix-format "%-6e %-30c")
                        (org-agenda-files
                         (rostre/org-notes-files work-notes-directory))))))
          ("r" "Reminders"
           ((tags-todo "reminder"
                       ((org-agenda-prefix-format "%-6e %-30c")))))
          ("d" "Deadlines"
           ((agenda "Deadlines"
                    ((org-agenda-overriding-header "Deadlines")
                     (org-agenda-span 'month)
                     (org-agenda-time-grid nil)
                     (org-agenda-entry-types '(:deadline))
                     (org-agenda-show-all-dates nil)
                     (org-deadline-warning-days 0)))))
          ("e" "Personal Projects"
           ((todo "TODO"
                 ((org-agenda-overriding-header "TODOs")
                  (org-agenda-files
                   (list (file-name-concat personal-notes-directory "journal.org")))))
            (todo "TODO"
                 ((org-agenda-overriding-header "Ideas")
                  (org-agenda-files
                   (list (file-name-concat personal-notes-directory "miniprojects.org")))))))
          ("f" "Fun"
           ((todo "TODO"
                  ((org-agenda-overriding-header "Movies")
                   (org-agenda-files
                    (list (file-name-concat personal-notes-directory "movies.org")))))
            (todo "TODO"
                  ((org-agenda-overriding-header "Games")
                   (org-agenda-files
                    (list (file-name-concat personal-notes-directory "games.org")))))
            (todo "TODO"
                  ((org-agenda-overriding-header "Books")
                   (org-agenda-files
                    (list (file-name-concat personal-notes-directory "books.org")))))
            (todo "TODO"
                  ((org-agenda-overriding-header "Blog Ideas")
                   (org-agenda-files
                    (list (file-name-concat personal-notes-directory "blogs.org")))))
            (todo "TODO"
                  ((org-agenda-overriding-header "Project Ideas")
                   (org-agenda-files
                    (list (file-name-concat personal-notes-directory "miniprojects.org")))))))))

#+end_src

** org-babel

org-babel is a tool for literate programming, which means code blocks interspersed with documentation, exactly like this configuration file.

*** languages

We can run HTTP requests from org-babel blocks using =ob-http=, so we preinstall that.

#+begin_src emacs-lisp

  (use-package ob-http
    :ensure (:wait t))

#+end_src

Then set up all the languages we might want to use inside org-babel blocks. Make sure that ob-http has finished loading first before doing this.

#+begin_src emacs-lisp

  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (python . t)
     (shell . t)
     (http . t)
     (sql . t)))

  (setq org-babel-python-command "/usr/local/bin/python3.9")

#+end_src

Finally set up org-babel so we don't have to confirm every single time that we want to run the code in an org-babel block.

#+begin_src emacs-lisp

  (setq org-confirm-babel-evaluate nil)

#+end_src

*** snippets

The =org-tempo= package allows us to set up some code snippets for easily adding in org-babel code blocks in an org-mode buffer. To insert an elisp block for example, one would type =<el= then TAB and a new empty block would be inserted.

#+begin_src emacs-lisp

  (require 'org-tempo)
  (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("py" . "src python"))
  (add-to-list 'org-structure-template-alist '("http" . "src http :pretty"))
  (add-to-list 'org-structure-template-alist '("sql" . "src sql"))
  (add-to-list 'org-structure-template-alist '("lua" . "src lua"))

#+end_src

** export

I use export to markdown a lot at work, so let's set that up.

#+begin_src emacs-lisp

  (require 'ox-md nil t)

#+end_src

* programming

All the packages I set up to do programming work.

** general visual aids

Firstly there's a few useful packages and settings that apply to pretty much any programming language. All packages in this section use minor modes to activate their functionality, and we can enable them only in programming buffers by hooking them up to =prog-mode=. =use-package= provides a handy =:hook= argument for hooking up a particular mode's hook, which by standard is the name of the mode suffixed by =-hook=, with any function we want to call when that hook fires.

I set tab width at 4 first for readability.

#+begin_src emacs-lisp

  (setq-default tab-width 4)

#+end_src

=indent-bars= is a newer version of =highlight-indent-guides= that provides bars to show how many levels of indentation down a particular block of code is. The extra features are that it is fully customizable in terms of look, plus it highlights the indent level where point is.

We only want to turn it on for =prog-mode= buffers, so hook into the minor mode after =prog-mode= is started.

#+begin_src emacs-lisp

  (use-package indent-bars
    :config
    (require 'indent-bars-ts)
    (setq indent-bars-treesit-support t)
    :hook
    (prog-mode . indent-bars-mode))

#+end_src

We can further customize =indent-bars= to activate only in the point's scope. By default it'll highlight a line in all indent levels aligned with the one that point is in. We have to do this by language though.

#+begin_src emacs-lisp

  (setq indent-bars-treesit-scope '((rust block)))

#+end_src

=rainbow-delimiters= is purely for making it clearer which closing bracket belongs to which opening bracket. Especially useful in lisp :).

#+begin_src emacs-lisp

  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode))

#+end_src

** snippets

=yasnippet= allows code snippets to be saved and expanded when a short 'key' string is entered into the buffer. It's particularly useful for initialising some org-babel blocks for common operations that I do while investigating issues.

=yas-indent-line= being 'fixed' makes sure that expansions are correctly indented in the context they are inserted.

=yasnippet-snippets= is a collection of default snippets to load in. You can see all the available snippets with =yas-describe-tables=.

#+begin_src emacs-lisp

  (use-package yasnippet
    :config
    (yas-global-mode 1)
    (setq yas-indent-line 'fixed))

  (use-package yasnippet-snippets
    :after yasnippet)

  (use-package consult-yasnippet
    :config
    (general-define-key "C-c _" 'consult-yasnippet))

#+end_src

