init.el

(setq org-agenda-custom-commands 
    '(("j" "Dashboard"
       ((agenda "" (
                    (org-deadline-warning-days 14)
                    (org-agenda-span 'day)
                    (org-agenda-start-with-log-mode '(state clock))
                    (org-agenda-prefix-format "%-10t %-12s %-6e")))
        (tags-todo "-create_jira_card+PRIORITY=\"A\"-SCHEDULED>\"<2000-01-01 Sat>\""
                   ((org-agenda-overriding-header "Do Now")
                    (org-agenda-sorting-strategy '(effort-up))
                    (org-agenda-prefix-format "%-6e %-30c")
                    (org-agenda-files
                     (rostre/org-notes-files work-notes-directory))))
        (tags-todo "-create_jira_card+PRIORITY=\"B\"-SCHEDULED>\"<2000-01-01 Sat>\""
                   ((org-agenda-overriding-header "Do Later")
                    (org-agenda-sorting-strategy '(effort-up))
                    (org-agenda-prefix-format "%-6e %-30c")
                    (org-agenda-files
                     (rostre/org-notes-files work-notes-directory))))
        (tags-todo "create_jira_card-SCHEDULED>\"<2000-01-01 Sat>\""
                   ((org-agenda-overriding-header "Create Jira Cards")
                    (org-agenda-prefix-format "%-6e %-30c")
                    (org-agenda-files
                     (rostre/org-notes-files work-notes-directory))))
        (tags-todo "-SCHEDULED>\"<2000-01-01 Sat>\""
                   ((org-agenda-overriding-header "Personal")
                    (org-agenda-sorting-strategy '(effort-up))
                    (org-agenda-prefix-format "%-6e %-30c")
                    (org-agenda-files
                     (list (file-name-concat personal-notes-directory "journal.org")))))))
        ("r" "Reminders"
         ((tags-todo "reminder"
                     ((org-agenda-prefix-format "%-6e %-30c")))))
        ("d" "Deadlines"
         ((agenda "Deadlines"
                  ((org-agenda-overriding-header "Deadlines")
                   (org-agenda-span 'month)
                   (org-agenda-time-grid nil)
                   (org-agenda-entry-types '(:deadline))
                   (org-agenda-show-all-dates nil)
                   (org-deadline-warning-days 0)))))))

(use-package ob-http
  :ensure (:wait t))

(org-babel-do-load-languages
 'org-babel-load-languages
 '((emacs-lisp . t)
   (python . t)
   (shell . t)
   (http . t)
   (sql . t)))

(setq org-babel-python-command "/usr/local/bin/python3.9")

(setq org-confirm-babel-evaluate nil)

(require 'org-tempo)
(add-to-list 'org-structure-template-alist '("sh" . "src shell"))
(add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
(add-to-list 'org-structure-template-alist '("py" . "src python"))
(add-to-list 'org-structure-template-alist '("http" . "src http :pretty"))
(add-to-list 'org-structure-template-alist '("sql" . "src sql"))
(add-to-list 'org-structure-template-alist '("lua" . "src lua"))

(require 'ox-md nil t)

(setq-default tab-width 4)

(use-package indent-bars
  :config
  (require 'indent-bars-ts)
  (setq indent-bars-treesit-support t)
  :hook
  (prog-mode . indent-bars-mode))

(setq indent-bars-treesit-scope '((rust block)))

(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))

(use-package yasnippet
  :config
  (yas-global-mode 1)
  (setq yas-indent-line 'fixed))

(use-package yasnippet-snippets
  :after yasnippet)
