config.org
** static code analysis

=tree-sitter= is an improvement on the way that emacs classically achieved parsing code buffers for the purposes of syntax highlighting and navigation. It provides a real abstract syntax tree (AST) rather than using regex.

However, it relies on having grammars installed that know how to parse various languages. Below we install a bunch of common grammars. We specify the version tags so that we're pinned to a particular version of the grammar, as the emacs packages are not guaranteed to keep up.

#+begin_src emacs-lisp

  (setq treesit-language-source-alist
   '((bash "https://github.com/tree-sitter/tree-sitter-bash" "v0.20.5")
     (c "https://github.com/tree-sitter/tree-sitter-c" "v0.20.7")
     (cpp "https://github.com/tree-sitter/tree-sitter-cpp" "v0.23.0")
     (cmake "https://github.com/uyha/tree-sitter-cmake" "v0.5.0")
     (css "https://github.com/tree-sitter/tree-sitter-css" "v0.23.0")
     (elisp "https://github.com/Wilfred/tree-sitter-elisp" "1.5.0")
     (go "https://github.com/tree-sitter/tree-sitter-go" "v0.23.1")
     (gomod "https://github.com/camdencheek/tree-sitter-go-mod" "v1.1.0")
     (html "https://github.com/tree-sitter/tree-sitter-html" "v0.23.0")
     (javascript "https://github.com/tree-sitter/tree-sitter-javascript" "v0.23.0" "src")
     (json "https://github.com/tree-sitter/tree-sitter-json" "v0.23.0")
     (make "https://github.com/alemuller/tree-sitter-make")
     (markdown "https://github.com/ikatyang/tree-sitter-markdown" "v0.7.1")
     (python "https://github.com/tree-sitter/tree-sitter-python" "v0.23.2")
     (rust "https://github.com/tree-sitter/tree-sitter-rust" "v0.23.0")
     (toml "https://github.com/tree-sitter/tree-sitter-toml" "v0.5.1")
     (tsx "https://github.com/tree-sitter/tree-sitter-typescript" "v0.23.0" "tsx/src")
     (typescript "https://github.com/tree-sitter/tree-sitter-typescript" "v0.23.0" "typescript/src")
     (yaml "https://github.com/ikatyang/tree-sitter-yaml" "v0.5.0")))

#+end_src

Now map all the old major modes to the new ones that use tree-sitter rather than regexes.

#+begin_src emacs-lisp

  (setq major-mode-remap-alist
   '((yaml-mode . yaml-ts-mode)
     (bash-mode . bash-ts-mode)
     (js2-mode . js-ts-mode)
     (typescript-mode . typescript-ts-mode)
     (json-mode . json-ts-mode)
     (css-mode . css-ts-mode)
     (python-mode . python-ts-mode)
     (go-mode . go-ts-mode)
     (rust-mode . rust-ts-mode)))

#+end_src

** language server protocol (lsp)

LSP was originally developed for VSCode, and provides a standardised interface for communicating with a language server that can provide live feedback on code as it is being typed, supporting features like warnings/errors underlined in the code.

Support is provided in emacs via either =eglot= or =lsp-mode=. =lsp-mode= is a little fancier and provides more bells and whistles in the UI, but =eglot= is simpler, better integrates with existing emacs functionality, and comes built in to emacs, so that's the one I use.

The configuration settings make sure that =eglot= is invoked in =python= and =go= buffers. It also shows documentation in a dedicated documentation buffer if one exists.

I've bound most of the features I regularly use to the prefix =C-c l=.

#+begin_src emacs-lisp

  (use-package eldoc) ;; dependency

  (use-package eglot
    :after eldoc
    :config
    (add-hook 'python-ts-mode-hook 'eglot-ensure)
    (add-hook 'go-ts-mode-hook 'eglot-ensure)
    (add-hook 'rust-ts-mode-hook 'eglot-ensure)
    (setq eglot-ignored-server-capabilities '())
    (setq eldoc-echo-area-prefer-doc-buffer t)
    :bind
    (:map eglot-mode-map
          ("C-c l f" . eglot-format-buffer)
          ("C-c l e" . flymake-show-project-diagnostics)
          ("C-c l n" . flymake-goto-next-error)
          ("C-c l p" . flymake-goto-prev-error)
          ("C-c l a" . eglot-code-actions)
          ("C-c l r" . eglot-rename)
          ("C-c l d" . xref-find-definitions)
          ("C-c l x" . xref-find-references)
          ("C-c l m" . compile)))

#+end_src

** debugger

There is a more established package called =dap-mode= for providing a debugging experience in emacs, but it depends on =lsp-mode=. An alternative is =dape-mode= that interacts with =eglot= instead. I need to experiment with this more.

#+begin_src emacs-lisp

  (use-package jsonrpc) ;; dependency

  (use-package dape
     :after jsonrpc
     :config
     (setq completion-in-region-function 'corfu))

#+end_src

** rust

Here I set up all the support and IDE features for the rust language. This [[https://robert.kra.hn/posts/rust-emacs-setup/#prerequisites][guide]] sets everything up using =lsp-mode=, but I want to use =eglot= instead. It's actually very fully featured out of the box. It even supports inline type hints!

The one thing to do is tell emacs to use =rust-ts-mode= for =.rs= files, as it doesn't know by default.

#+begin_src emacs-lisp

  (add-to-list 'auto-mode-alist '("\\.rs\\'" . rust-ts-mode))

#+end_src

* file system navigation

Sticking with good old =dired=, although we configure it with some quality of life features. The keymap settings mean that we can create new files and go up directories with single key presses. By using ls-based dired, we can sort all of the directories to the top and hide any backup files.

#+begin_src emacs-lisp

  (use-package dired
    :ensure nil
    :commands (dired dired-jump)
    :bind (("C-x C-j" . dired-jump))
    (:map dired-mode-map
          ;; b goes up to parent dir
          ("b" . 'dired-up-directory)
          ;; N creates new file
          ("N" . 'find-file))
    :config
    (require 'dired-x)
    ;; Use gls for driving dired on mac
    (when (eq system-type 'darwin)
      (setq insert-directory-program "gls"))
    (setq dired-use-ls-dired t)
    ;; Put all the directories at the top, hide backup files
    (setq dired-listing-switches "-aghoB --group-directories-first")
    (setq delete-by-moving-to-trash t))

#+end_src

* terminal

Sometimes you can't do absolutely /everything/ in emacs.

I have experimented with =eshell= in the past, but in the end I settled on using =vterm=, which is a full terminal emulator within emacs, rather than a shell implementation like the former. This means it doesn't integrate as well with other emacs features, but it does perform better particularly when large amounts of outputs are printed. It also works a little more reliably when CLI tools do some of the fancier stuff.

The =multi-vterm= package supports having multiple vterm terminals at once running in the same emacs.

#+begin_src emacs-lisp

  (use-package vterm
    :commands vterm
    :config
    (setq term-prompt-regexp "^[^#$%>\n]*[#$%>] *")
    (setq vterm-max-scrollback 10000)
    ;; key bindings
    (general-define-key "C-c v" 'multi-vterm))

  (use-package multi-vterm)

#+end_src

* macros

This section is for keyboard macros that I've recorded and deemed useful enough to bind to a key for use evermore.

To add new macros to this section:
- Start a new macro with =C-x (=.
- Type some commands
- End the new macro with =C-x )=.
- Run =M-x name-last-kbd-macro= to give the macro a name.
- Navigate to this buffer and open a new elisp org-babel block (Type <el and hit TAB).
- Run =M-x insert-kbd-macro= to paste the code for the macro to the org-babel block.
- Bind the new function to a key using =general-define-key=. I tend to use the prefix =C-c k=.

Record a quick dated note to the team logbook.

#+begin_src emacs-lisp

  (defalias 'rostre/macro/record-feedback
    (kmacro "C-c d c C-k t e a m - l o g b o o k <return> n"))
  (general-define-key "C-c k n" 'rostre/macro/record-feedback)

	#+end_src

Record a todo to the inbox at priority A

#+begin_src emacs-lisp

  (defalias 'rostre/macro/new-todo
    (kmacro "C-c d c <return> t <return>"))
  (general-define-key "C-c k t" 'rostre/macro/new-todo)

#+end_src

Indent a selected block by four spaces

#+begin_src emacs-lisp

  (defalias 'rostre/macro/indent-block
    (kmacro "C-x r t SPC SPC SPC SPC <return>"))
  (general-define-key "C-c k i" 'rostre/macro/indent-block)

#+end_src

Paste an image from the clipboard, give it the 100% img width property, then toggle inline images off and on to scale it.

#+begin_src emacs-lisp

  (defalias 'rostre/macro/paste-image
   (kmacro "C-c y C-p C-p C-e <return> i m g w i d t h <tab> C-c C-x C-v C-c C-x C-v"))
  (general-define-key "C-c k y" 'rostre/macro/paste-image)

#+end_src

* work

The configuration here is stuff specifically for work, which doesn't apply to my home emacs use. Switch the following flag on to enable all of this stuff.

#+begin_src emacs-lisp

  (setq in-office nil)

#+end_src

** copilot

I have a github copilot license to use at work. It integrates pretty well with emacs, although does get in the way of =corfu=. It's still very useful.

Obviously there's some additional setup required here, check out [[https://github.com/copilot-emacs/copilot.el][the repo]] for more details.

TODO - redo this with elpaca

#+begin_src emacs-lisp

;;  (use-package copilot
;;    :if in-office
;;    :vc (:fetcher github :repo copilot-emacs/copilot.el)
;;    :hook (prog-mode . copilot-mode)
;;    :bind (:map copilot-completion-map
;;                ("<tab>" . 'copilot-accept-completion)
;;                ("TAB" . 'copilot-accept-completion)
;;                ("C-TAB" . 'copilot-accept-completion-by-word)
;;                ("C-<tab>" . 'copilot-accept-completion-by-word)))

#+end_src

** org-mode

There's a bunch of specific org-mode functionality I've built specifically for work as a manager. I don't think I'm likely to use this outside of work.

#+begin_src emacs-lisp

  (defun rostre/filter-for-one-to-one-meeting ()
    (interactive)
    (let ((person-tag
           (completing-read "1-1 for person: " (org-get-buffer-tags)))
          (min-time
           (with-temp-buffer
             (org-time-stamp nil)
             (buffer-string))))
      (org-match-sparse-tree
       nil
       (concat "+" person-tag "+CREATED>=\"" min-time "\"|+downflow+CREATED>=\"" min-time "\""))))

  (general-define-key "C-c f o" 'rostre/filter-for-one-to-one-meeting)

#+end_src

