init.el

(setq treesit-language-source-alist
 '((bash "https://github.com/tree-sitter/tree-sitter-bash" "v0.20.5")
   (c "https://github.com/tree-sitter/tree-sitter-c" "v0.20.7")
   (cpp "https://github.com/tree-sitter/tree-sitter-cpp" "v0.23.0")
   (cmake "https://github.com/uyha/tree-sitter-cmake" "v0.5.0")
   (css "https://github.com/tree-sitter/tree-sitter-css" "v0.23.0")
   (elisp "https://github.com/Wilfred/tree-sitter-elisp" "1.5.0")
   (go "https://github.com/tree-sitter/tree-sitter-go" "v0.23.1")
   (gomod "https://github.com/camdencheek/tree-sitter-go-mod" "v1.1.0")
   (html "https://github.com/tree-sitter/tree-sitter-html" "v0.23.0")
   (javascript "https://github.com/tree-sitter/tree-sitter-javascript" "v0.23.0" "src")
   (json "https://github.com/tree-sitter/tree-sitter-json" "v0.23.0")
   (make "https://github.com/alemuller/tree-sitter-make")
   (markdown "https://github.com/ikatyang/tree-sitter-markdown" "v0.7.1")
   (python "https://github.com/tree-sitter/tree-sitter-python" "v0.23.2")
   (rust "https://github.com/tree-sitter/tree-sitter-rust" "v0.23.0")
   (toml "https://github.com/tree-sitter/tree-sitter-toml" "v0.5.1")
   (tsx "https://github.com/tree-sitter/tree-sitter-typescript" "v0.23.0" "tsx/src")
   (typescript "https://github.com/tree-sitter/tree-sitter-typescript" "v0.23.0" "typescript/src")
   (yaml "https://github.com/ikatyang/tree-sitter-yaml" "v0.5.0")))

(setq major-mode-remap-alist
 '((yaml-mode . yaml-ts-mode)
   (bash-mode . bash-ts-mode)
   (js2-mode . js-ts-mode)
   (typescript-mode . typescript-ts-mode)
   (json-mode . json-ts-mode)
   (css-mode . css-ts-mode)
   (python-mode . python-ts-mode)
   (go-mode . go-ts-mode)
   (rust-mode . rust-ts-mode)))

(use-package eldoc) ;; dependency

(use-package eglot
  :after eldoc
  :config
  (add-hook 'python-ts-mode-hook 'eglot-ensure)
  (add-hook 'go-ts-mode-hook 'eglot-ensure)
  (add-hook 'rust-ts-mode-hook 'eglot-ensure)
  (setq eglot-ignored-server-capabilities '())
  (setq eldoc-echo-area-prefer-doc-buffer t)
  :bind
  (:map eglot-mode-map
        ("C-c l f" . eglot-format-buffer)
        ("C-c l e" . flymake-show-project-diagnostics)
        ("C-c l n" . flymake-goto-next-error)
        ("C-c l p" . flymake-goto-prev-error)
        ("C-c l a" . eglot-code-actions)
        ("C-c l r" . eglot-rename)
        ("C-c l d" . xref-find-definitions)
        ("C-c l x" . xref-find-references)
        ("C-c l m" . compile)))

(use-package jsonrpc) ;; dependency

(use-package dape
  :after jsonrpc)

(add-to-list 'auto-mode-alist '("\\.rs\\'" . rust-ts-mode))

(use-package dired
  :ensure nil
  :commands (dired dired-jump)
  :bind (("C-x C-j" . dired-jump))
  (:map dired-mode-map
        ;; b goes up to parent dir
        ("b" . 'dired-up-directory)
        ;; N creates new file
        ("N" . 'find-file))
  :config
  (require 'dired-x)
  :custom
  ;; Use gls for driving dired on mac
  ((when system-type 'darwin
         (insert-directory-program "gls"))
   (dired-use-ls-dired t)
   ;; Put all the directories at the top, hide backup files
   (dired-listing-switches "-aghoB --group-directories-first")
   (delete-by-moving-to-trash t)))

(use-package vterm
  :commands vterm
  :config
  (setq term-prompt-regexp "^[^#$%>\n]*[#$%>] *")
  (setq vterm-max-scrollback 10000)
  ;; key bindings
  (general-define-key "C-c v" 'multi-vterm))

(use-package multi-vterm)

(defalias 'rostre/macro/record-feedback
  (kmacro "C-c d c C-k t e a m - l o g b o o k <return> n"))
(general-define-key "C-c k n" 'rostre/macro/record-feedback)

(defalias 'rostre/macro/new-todo
  (kmacro "C-c d c <return> t <return>"))
(general-define-key "C-c k t" 'rostre/macro/new-todo)

(defalias 'rostre/macro/indent-block
  (kmacro "C-x r t SPC SPC SPC SPC <return>"))
(general-define-key "C-c k i" 'rostre/macro/indent-block)

(defalias 'rostre/macro/paste-image
 (kmacro "C-c y C-p C-p C-e <return> i m g w i d t h <tab> C-c C-x C-v C-c C-x C-v"))
(general-define-key "C-c k y" 'rostre/macro/paste-image)

(setq in-office nil)

;;  (use-package copilot
;;    :if in-office
;;    :vc (:fetcher github :repo copilot-emacs/copilot.el)
;;    :hook (prog-mode . copilot-mode)
;;    :bind (:map copilot-completion-map
;;                ("<tab>" . 'copilot-accept-completion)
;;                ("TAB" . 'copilot-accept-completion)
;;                ("C-TAB" . 'copilot-accept-completion-by-word)
;;                ("C-<tab>" . 'copilot-accept-completion-by-word)))

(defun rostre/filter-for-one-to-one-meeting ()
  (interactive)
  (let ((person-tag
         (completing-read "1-1 for person: " (org-get-buffer-tags)))
        (week-ago
         (format-time-string "%Y-%m-%d"
                             (days-to-time
                              (-
                               (- (time-to-days (current-time)) 7)
                               (time-to-days 0))))))
    (org-match-sparse-tree
     nil
     (concat "+" person-tag "+CREATED>=\"<" week-ago ">\"|+downflow+CREATED>=\"<" week-ago ">\""))))

(general-define-key "C-c f o" 'rostre/filter-for-one-to-one-meeting)
